################################################################################
# HOMEBREW FORMULAE                                                            #
################################################################################

##################################################
# ZSH                                            #
##################################################

# themes
brew "pure"

# plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

##################################################
# GENERAL                                        #
##################################################

# utilities
brew "coreutils"
brew "findutils"
brew "diffutils"
# brew "uutils-coreutils"   # potential replacement for "coreutils"
# brew "uutils-findutils"   # potential replacement for "findutils"
# brew "uutils-diffutils"   # potential replacement for "diffutils"
brew "gnu-sed"
brew "gnu-tar"
brew "tree"

# interactive
brew "tmux"
brew "neovim"
brew "less"
brew "fzf"

# search
brew "ripgrep"
brew "fd"

# privsec
brew "gnupg"

# media
brew "exiftool"
brew "ffmpeg"
brew "imagemagick"

# sync
brew "rsync"
brew "rclone"

# networking
brew "xh"
brew "wget"

# benchmarking
brew "hyperfine"
brew "oha"

##################################################
# DEVELOPMENT                                    #
##################################################

# source control
brew "git"

# programming languages
brew "go"        # go compiler
brew "rust"      # rust compiler
brew "pyenv"     # python version manager
brew "nodenv"    # node version manager

# containerization
brew "lima"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
# brew "podman"             # potential replacement for "docker,docker-buildx"
# brew "podman-compose"     # potential replacement for "docker-compose"

# other
# brew "tokei"


################################################################################
# HOMEBREW CASKS                                                               #
################################################################################

##################################################
# APPLICAITONS                                   #
##################################################

cask "firefox"
cask "ghostty"
cask "visual-studio-code"

##################################################
# FONTS                                          #
##################################################

cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
