################################################################################
# HOMEBREW FORMULAE                                                            #
################################################################################

##################################################
# ZSH                                            #
##################################################

# themes
brew "pure"

# plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# highlighitng
brew "source-highlight"

##################################################
# GENERAL                                        #
##################################################

# utilities
brew "coreutils"
brew "findutils"
brew "diffutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "tree"

# interactive
brew "tmux"
brew "neovim"
brew "less"
brew "fzf"

# search
brew "fd"
brew "ripgrep"

# privsec
brew "gnupg"

# media
brew "ffmpeg"
brew "imagemagick"
brew "exiftool"

# transfer
brew "wget"
brew "rsync"
brew "rclone"
# brew "restic"

# benchmarking
# brew "hyperfine"
# brew "oha"

##################################################
# DEVELOPMENT                                    #
##################################################

# source control
brew "git"

# programming languages
brew "go"        # go compiler
brew "rust"      # rust compiler
brew "pyenv"     # python version manager (pip bundled)
brew "nodenv"    # nodejs version manager (npm bundled)

# containerization
# brew "lima"
# brew "colima"               # could remove and replace with just "lima"
# brew "docker"
# brew "docker-buildx"
# brew "docker-compose"
brew "podman"             # potential replacement for "docker,docker-buildx"
brew "podman-compose"     # potential replacement for "docker-compose"


################################################################################
# HOMEBREW CASKS                                                               #
################################################################################

##################################################
# APPLICAITONS                                   #
##################################################

cask "brave-browser"
cask "firefox"
cask "ghostty"
casl "obsidian"
cask "visual-studio-code"

##################################################
# FONTS                                          #
##################################################

cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
