{
  "catppuccin": { "branch": "main" },
  "cmp": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-lsp": { "branch": "main" },
  "cmp-nvim-lua": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-signature": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "mason": { "branch": "main" },
  "mason-lspconfig": { "branch": "main" },
  "mini-pairs": { "branch": "main" },
  "mini-statusline": { "branch": "main" },
  "neotree": { "branch": "main" },
  "noice.nvim": { "branch": "main" },
  "nui": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "plenary": { "branch": "master" },
  "telescope": { "branch": "master" },
  "telescope-fzf-native": { "branch": "main" },
  "tmux-navigator": { "branch": "master" },
  "treesitter": { "branch": "master" },
  "treesitter-textobjects": { "branch": "master" },
  "undotree": { "branch": "master" },
  "web-devicons": { "branch": "master" }
}
